package com.desaysv.psmap.model.bean.standard

/**
 * 导航中路线偏好设置
 */
data class OnNaviRoutePreferOperaData(
    val strategy: Int = -1, //路线偏好（480以下版本）： -1:按地图内部设置的算路偏好 1:避免收费 2:多策略，不勾选任何偏好
    // 3:不⾛⾼速 4:躲避拥堵 5:避免收费+不⾛⾼速 6:躲避拥堵+不⾛⾼速 7:躲避拥堵+避免收费 8:躲避拥堵+避免收费+不⾛⾼速 20:⾼速优先 24:躲避拥堵+⾼速优先
    val newStrategy: Int = -100, //路线偏好:（480及以上版本）： 9:⼤路优先 10:速度最快 11:少收费 12:⾼德推荐
    // 13:不⾛⾼速 14:躲避拥堵 15:少收费+不⾛⾼速 16:躲避拥堵+不⾛⾼速 17:躲避拥堵+少收费 18:躲避拥堵+少收费+不⾛⾼速
    // 34:⾼速优先 39:躲避拥堵+⾼速优先 44:躲避拥堵+⼤路优先 45:躲避拥堵+速度最快
) : ResponseDataData()
