package com.desaysv.psmap.model.bean.standard

import com.desaysv.psmap.base.utils.BaseConstant

object StandardJsonConstant {
//    const val SERVER_VERSION = "1.0.0.20250307"
    var SERVER_VERSION = BaseConstant.APP_VERSION

    enum class ResponseResult(val code: Int, val msg: String) {
        OK(10000, "请求成功"), //请求成功/执⾏成功
        FAIL_10001(10001, "⾮法参数"), //请求参数有误
        FAIL_10002(10002, " 缺少离线地图数据"), //缺少离线地图数据，前装项⽬⼀般情况为地图未灌装
        FAIL_10003(10003, "地图软件未授权"), //前装项⽬⼀般情况为地图软件未激活
        FAIL_10004(10004, "未规划路线"), //当前不在导航中，没有已规划的路线
        FAIL_10005(10005, "未设置家 "),//调⽤回家时，但程序内未设置家的地址
        FAIL_10006(10006, "未设置公司 "),//调⽤回公司时，但程序内未设置公司的地址
        FAIL_10007(10007, "⽐例尺已最⼤"), //当前⽐例尺已最⼤，不能再放⼤
        FAIL_10008(10008, "⽐例尺已最⼩"), //当前⽐例尺已最⼩，不能再缩⼩
        FAIL_10009(10009, "⽹络不畅"), //当前⽆⽹络/⽹络连接不稳定
        FAIL_10010(10010, "不⽀持的视图"), //软件不⽀持的视图功能
        FAIL_10011(10011, "途经点重复"), //添加途经点失败，该点已在⾏程点中
        FAIL_10012(10012, "途经点已满"), //添加途经点失败，途经点已满15个
        FAIL_10013(10013, "起点错误"), //起点不在⽀持范围内
        FAIL_10014(10014, "终点错误 "),//终点不在⽀持范围内
        FAIL_10015(10015, "途经点错误 "),//途经点不在⽀持范围内
        FAIL_10016(10016, "路线规划失败 "),//路线规划失败，未知错误导致
        FAIL_10018(10018, "导航未启动"), //导航未启动，不⽀持操作
        FAIL_10019(10019, "⽆⽹⽆数据 "),//当前⽆⽹络连接，且本地⽆离线数据
        FAIL_10020(10020, "未知错误"),
        FAIL_10021(10021, "城市不⽀持 "),//查询的城市暂不⽀持路况查询
        FAIL_10023(10023, "未找到结果"), //未找到道路/POI结果
        FAIL_10024(10024, "⽆权限访问"), //未获取到系统权限
        FAIL_10025(10025, "引擎初始化失败"), //引擎初始化失败，⽆法获取数据
        FAIL_10026(10026, "SDK初始化错误"), //SDK未初始化/初始化失败，⽆法获取数据
        FAIL_10027(10027, "Auto未启动"), //软件未启动，⽆法响应接⼝
        FAIL_10028(10028, "功能不⽀持"), //当前场景下，⽆法响应该接⼝
        FAIL_10029(10029, "后台下不⽀持"), //软件在后台运⾏，⽆法响应该接⼝
        FAIL_10030(10030, "回调异常"),
        FAIL_10031(10031, "监听为空"),
        FAIL_10032(10032, "请求失败"),
        FAIL_10033(10033, "连接失败"), //协议SDK与auto服务连接失败
        FAIL_10034(10034, "执⾏动作取消"), //执⾏动作流程因⽤户⼿动操作造成动作取消
        FAIL_10035(10035, "设置家成功"), //设置家的动作执⾏成功
        FAIL_10036(10036, "设置公司成功"), //设置公司的动作执⾏成功
        FAIL_10037(10037, "设置普通收藏点成功"), //设置收藏点的动作执⾏成功
        FAIL_10038(10038, "当前已静⾳"), //执⾏失败，当前已静⾳
        FAIL_10039(10039, "当前已恢复静⾳"), //执⾏失败，当前已恢复静⾳
        FAIL_10040(10040, "GPS未定位，⽆法执⾏操作"), //GPS未定位，⽆法执⾏操作
        FAIL_10041(10041, "请求频繁，请稍后重试"), //请求频繁，请稍后重试
        FAIL_10042(10042, "路线刷新失败，请稍后重试"), //路线刷新失败，请稍后重试
        FAIL_10043(10043, "没有停⻋场数据"), //没有停⻋场数据
        FAIL_10044(10044, "正在响应缩放⽐例尺"), //正在响应缩放⽐例尺
        FAIL_10045(10045, "开启避开限⾏失败，未设置⻋牌号"), //开启避开限⾏失败，未设置⻋牌号
        FAIL_10046(10046, "重复设置偏好"), // 重复设置偏好
        FAIL_10047(10047, "存在⾃动添加的途经点⽆法删除"), // 存在⾃动添加的途经点⽆法删除
        FAIL_10048(10048, "当前不在导航中，⽆法切换主辅路"), // 当前不在导航中，⽆法切换主辅路
        FAIL_10049(10049, "没有主辅路区分"), // 没有主辅路区分
        FAIL_10050(10050, "主辅路切换失败"), // 主辅路切换失败
        FAIL_10051(10051, "当前不在导航中，⽆法切换桥上桥下"), // 当前不在导航中，⽆法切换桥上桥下
        FAIL_10052(10052, "没有桥上桥下"), // 没有桥上桥下
        FAIL_10053(10053, "桥上桥下切换失败"), // 桥上桥下切换失败
        FAIL_10054(10054, "起终点相同"), // 起终点相同
        FAIL_10055(10055, "⽆法透出地图⽐例尺"), // 当⽆法对外透出当前地图⽐例尺等级时，返回此错误码
        FAIL_10056(10056, "系统定位服务关闭"), // 系统定位服务关闭，与⻋辆位置相关的功能不可⽤
        FAIL_10057(10057, "导航定位权限关闭"), // 导航定位权限关闭，与⻋辆位置相关的功能不可⽤
        FAIL_10058(10058, "轨迹/位置上传权限关闭"), // 轨迹/位置上传权限关闭，与⻋辆位置上传相关的功能不可⽤
        FAIL_10059(10059, "未同意开机敬告（仅奥迪使⽤）"), // 未同意开机敬告（仅奥迪使⽤）
        FAIL_10060(10060, "不在NCA导航态"), // 不在NCA导航态
        FAIL_10061(10061, "未设置家和公司"), // 请求家和公司信息，但程序内未设置家和公司的地址
        FAIL_10062(10062, "在NCA导航中，但不存在下⼀个ODD路段"), // 不存在下⼀个ODD路段
        FAIL_10063(10063, "没有途经点可以删除"), //
    }
}